## df.sort_values()--->sort values of dataframe by any series or sort values of series

In [2]:
import pandas as pd 
  
# create dataframe 
data = {'name': ['Simon', 'Marsh', 'Gaurav', 'Alex', 'Selena'],  
        'Maths': [8, 5, 6, 9, 7],  
        'Science': [7, 9, 5, 4, 7], 
        'English': [7, 4, 7, 6, 8]} 
  
df = pd.DataFrame(data)
df

     name  Maths  Science  English
0   Simon      8        7        7
1   Marsh      5        9        4
2  Gaurav      6        5        7
3    Alex      9        4        6
4  Selena      7        7        8

#### Sorting rows by Science

In [4]:
df.sort_values(by='Science',ascending=False)

     name  Maths  Science  English
1   Marsh      5        9        4
0   Simon      8        7        7
4  Selena      7        7        8
2  Gaurav      6        5        7
3    Alex      9        4        6

#### Sort rows by Maths and then by English.

In [6]:
df.sort_values(by=['Maths','English'])

     name  Maths  Science  English
1   Marsh      5        9        4
2  Gaurav      6        5        7
4  Selena      7        7        8
0   Simon      8        7        7
3    Alex      9        4        6

In [12]:
li=[(44,2,33,4),(12,3,40),(501,6)]
li

[(44, 2, 33, 4), (12, 3, 40), (501, 6)]

In [13]:
df=pd.DataFrame(li,columns=['a','b','c','d'])
df

     a  b     c    d
0   44  2  33.0  4.0
1   12  3  40.0  NaN
2  501  6   NaN  NaN

In [15]:
df.sort_values(by='d')

     a  b     c    d
0   44  2  33.0  4.0
1   12  3  40.0  NaN
2  501  6   NaN  NaN

#### If you want missing values first.

In [16]:
df.sort_values(by='d',na_position='first')

     a  b     c    d
1   12  3  40.0  NaN
2  501  6   NaN  NaN
0   44  2  33.0  4.0